var tests = {
  "list": [{
    "test1": {
      "title": "我需要向人表示關懷",
      "type": "F"
    },
    "test2": {
      "title": "我選擇與人保持距離",
      "type": "H"
    }
  }, {
    "test1": {
      "title": "一般而言，我頗容易被激怒",
      "type": "B"
    },
    "test2": {
      "title": "一般而言，我絕不容易被激怒",
      "type": "A"
    }
  }, {
    "test1": {
      "title": "我是一個浪漫兼且想像能力豐富的人",
      "type": "E"
    },
    "test2": {
      "title": "我是一個實事求是、腳踏實地的人",
      "type": "B"
    }
  }, {
    "test1": {
      "title": "我既倔強又疑心大",
      "type": "B"
    },
    "test2": {
      "title": "我既心軟又感情用事",
      "type": "F"
    }
  }, {
    "test1": {
      "title": "我經常憂慮自己流失了重要的機會",
      "type": "I"
    },
    "test2": {
      "title": "我憂慮當我不設防的時候，人家會乘機而入",
      "type": "G"
    }
  }, {
    "test1": {
      "title": "一般而言，我是個外向的人",
      "type": "I"
    },
    "test2": {
      "title": "我是個殷實而自律的人",
      "type": "D"
    }
  }, {
    "test1": {
      "title": "我努力地令人喜歡及接受我",
      "type": "C"
    },
    "test2": {
      "title": "我並不重視人家是否喜歡或接受我",
      "type": "D"
    }
  }, {
    "test1": {
      "title": "我生命中重要的價值包括責任及工作",
      "type": "B"
    },
    "test2": {
      "title": "我生命中重要的價值包括和諧與被接受",
      "type": "A"
    }
  }, {
    "test1": {
      "title": "遭遇困擾的時候，我會獨自沉思",
      "type": "E"
    },
    "test2": {
      "title": "遭遇問題的時候，我會盡量看開一點",
      "type": "I"
    }
  }, {
    "test1": {
      "title": "我不能停止考慮各種可能性而去採取單一行動",
      "type": "H"
    },
    "test2": {
      "title": "我不能處之泰然及變得更有彈性",
      "type": "D"
    }
  }, {
    "test1": {
      "title": "我是一個實事求是的求存者",
      "type": "G"
    },
    "test2": {
      "title": "我是一個志向高的理想主義者",
      "type": "D"
    }
  }, {
    "test1": {
      "title": "我經常可以不理會感受，先把工作完成",
      "type": "C"
    },
    "test2": {
      "title": "一般而言，我要擺平自己的感受，才能採取行動",
      "type": "E"
    }
  }, {
    "test1": {
      "title": "一般而言，我做事謹慎及有系統",
      "type": "B"
    },
    "test2": {
      "title": "一般而言，我喜愛及甘於冒險",
      "type": "I"
    }
  }, {
    "test1": {
      "title": "我時常不能堅持己見，而容許別人操縱我",
      "type": "A"
    },
    "test2": {
      "title": "我不肯妥協及對人要求過高",
      "type": "D"
    }
  }, {
    "test1": {
      "title": "許多時候我之所以成功是因為我有本事在人心目中留下好印象",
      "type": "C"
    },
    "test2": {
      "title": "雖然我沒有興趣拓展自己的人際溝通技巧，我仍然能夠成功",
      "type": "H"
    }
  }, {
    "test1": {
      "title": "基本而言，我是個平易近人、容易相處的人",
      "type": "A"
    },
    "test2": {
      "title": "基本上，我盡力衛護本身的利益",
      "type": "G"
    }
  }, {
    "test1": {
      "title": "一直而來，我屬於自我肯定，並且推動自己成功",
      "type": "C"
    },
    "test2": {
      "title": "我為人謙遜，並且用自己的步伐做事",
      "type": "A"
    }
  }, {
    "test1": {
      "title": "我對自己太過認真及嚴謹",
      "type": "D"
    },
    "test2": {
      "title": "我對自己太過縱容及任意妄為",
      "type": "I"
    }
  }, {
    "test1": {
      "title": "組織資源及實踐計劃是我的強項",
      "type": "G"
    },
    "test2": {
      "title": "產生嶄新意念及令身邊的人對這些意念感覺興奮是我的強項",
      "type": "I"
    }
  }, {
    "test1": {
      "title": "我引自己的清晰度及客觀態度為傲",
      "type": "H"
    },
    "test2": {
      "title": "我引自己的可信度及承諾感為傲",
      "type": "B"
    }
  }, {
    "test1": {
      "title": "我一生人大部份時間都是大起大落",
      "type": "I"
    },
    "test2": {
      "title": "我一生人大部份時間都是一個細水長流、平平穩穩的人",
      "type": "A"
    }
  }, {
    "test1": {
      "title": "我入睡有困難",
      "type": "H"
    },
    "test2": {
      "title": "我很容易入睡",
      "type": "A"
    }
  }, {
    "test1": {
      "title": "當我感覺憤怒的時候，我典型的反應就是破口大罵",
      "type": "G"
    },
    "test2": {
      "title": "當我感覺憤怒的時候，我典型的反應就是自我抽離",
      "type": "C"
    }
  }, {
    "test1": {
      "title": "我經常設法與人拉近距離",
      "type": "F"
    },
    "test2": {
      "title": "我經常設法知道別人想從我那裡得到什麼好處",
      "type": "B"
    }
  }, {
    "test1": {
      "title": "一般而言，我為人太過開放及天真",
      "type": "A"
    },
    "test2": {
      "title": "一般而言，我的防衛性太強",
      "type": "B"
    }
  }, {
    "test1": {
      "title": "我頭腦清醒活力充沛",
      "type": "I"
    },
    "test2": {
      "title": "我忠於朋友及對人真心關懷",
      "type": "F"
    }
  }, {
    "test1": {
      "title": "我覺得自己感情過份脆弱",
      "type": "E"
    },
    "test2": {
      "title": "我經常覺得別人對我的犧牲習以為常",
      "type": "F"
    }
  }, {
    "test1": {
      "title": "一般而言，我缺乏自律",
      "type": "I"
    },
    "test2": {
      "title": "一般而言，我與人缺乏連繫",
      "type": "H"
    }
  }, {
    "test1": {
      "title": "別人信任我，因為我充滿自信及能替他們的利益著想",
      "type": "G"
    },
    "test2": {
      "title": "別人信任我，因為我公正及會做「對」的事情",
      "type": "D"
    }
  }, {
    "test1": {
      "title": "我經常因自己的神經質、缺乏安全感及自我懷疑感到困擾",
      "type": "B"
    },
    "test2": {
      "title": "我經常因自己的憤怒感、追求完美及缺乏耐性感到困擾",
      "type": "D"
    }
  }, {
    "test1": {
      "title": "我太願意幫助別人，個人健康及處境因此受損",
      "type": "F"
    },
    "test2": {
      "title": "我太過注重個人的需求，人際關係因此受損",
      "type": "E"
    }
  }, {
    "test1": {
      "title": "我傾情於令我激情的環境",
      "type": "E"
    },
    "test2": {
      "title": "我喜歡令我感覺平和的情境",
      "type": "A"
    }
  }, {
    "test1": {
      "title": "我為人甚為圓滿、有魅力及有野心",
      "type": "C"
    },
    "test2": {
      "title": "我為人直接、循規蹈矩及有理想",
      "type": "D"
    }
  }, {
    "test1": {
      "title": "當面對嶄新經驗的時候，我問自己這經驗對我的實用價值何在",
      "type": "C"
    },
    "test2": {
      "title": "當面對嶄新經驗的時候，我問自己是否會享受這經驗",
      "type": "I"
    }
  }, {
    "test1": {
      "title": "當遭遇困難的時候，我能夠視而不見",
      "type": "A"
    },
    "test2": {
      "title": "當遭遇困難的時候，我會做一些令我自己開心的事情",
      "type": "I"
    }
  }, {
    "test1": {
      "title": "我信賴我的朋友，而他們也知能夠信賴我",
      "type": "B"
    },
    "test2": {
      "title": "我從來沒有信賴別人，我習慣事事靠自己",
      "type": "C"
    }
  }, {
    "test1": {
      "title": "我難以放下過去承諾，因此在生命中不能作出重要的轉變",
      "type": "B"
    },
    "test2": {
      "title": "我難以作出長期的承諾，因此可以在生命中輕易作出重大的轉變",
      "type": "C"
    }
  }, {
    "test1": {
      "title": "當我與朋友辯論時，我一定強調自己的立場",
      "type": "H"
    },
    "test2": {
      "title": "當我與朋友辯駁時，我會得過且過以免傷和氣",
      "type": "A"
    }
  }, {
    "test1": {
      "title": "我為人謹慎，經常替未發生的問題作好準備",
      "type": "B"
    },
    "test2": {
      "title": "我為人即興，選擇臨場發揮",
      "type": "I"
    }
  }, {
    "test1": {
      "title": "當別人未能欣賞我為他們所做的事情，我會覺得憤怒",
      "type": "F"
    },
    "test2": {
      "title": "當別人不聽從我的意見時，我會覺得憤怒",
      "type": "D"
    }
  }, {
    "test1": {
      "title": "我需要明白自己的感受，因此我經常內省",
      "type": "E"
    },
    "test2": {
      "title": "我必須做到要做的事情，因此很少內省",
      "type": "G"
    }
  }, {
    "test1": {
      "title": "我傾向於向最壞的地方去想",
      "type": "B"
    },
    "test2": {
      "title": "我傾向於認為一切都會有最好的安排",
      "type": "A"
    }
  }, {
    "test1": {
      "title": "我堅持所有事情都要做得正確，而這種態度有時令人不安",
      "type": "D"
    },
    "test2": {
      "title": "我不喜歡別人向我施壓，因此也不喜歡向人施壓",
      "type": "A"
    }
  }, {
    "test1": {
      "title": "一般而言，我喜歡放開懷抱，「去到盡」",
      "type": "I"
    },
    "test2": {
      "title": "一般而言，我不喜歡失控",
      "type": "D"
    }
  }, {
    "test1": {
      "title": "我引以為傲的是我在別人生命中所佔的重要地位",
      "type": "F"
    },
    "test2": {
      "title": "我引以為傲的是我對新事物的開放態度",
      "type": "I"
    }
  }, {
    "test1": {
      "title": "我在人際關係方面的問題源自我過度敏感及事事個人化",
      "type": "E"
    },
    "test2": {
      "title": "我在人際關係方面的問題源自我不太尊重社會規條",
      "type": "H"
    }
  }, {
    "test1": {
      "title": "我太過在意自己的表現是否較別人出色",
      "type": "D"
    },
    "test2": {
      "title": "我太過在意替別人將事情辦妥",
      "type": "C"
    }
  }, {
    "test1": {
      "title": "能夠自給自足對我而言是非常重要的",
      "type": "G"
    },
    "test2": {
      "title": "被人珍惜及仰慕對我而言是非常重要的",
      "type": "C"
    }
  }, {
    "test1": {
      "title": "我對所愛的人有強烈的佔有慾",
      "type": "F"
    },
    "test2": {
      "title": "我經常試探所愛的人，看看他們是否願意為我付出",
      "type": "B"
    }
  }, {
    "test1": {
      "title": "我引以為傲的是自己的堅持力",
      "type": "B"
    },
    "test2": {
      "title": "我引以為傲的是我的原創力",
      "type": "E"
    }
  }, {
    "test1": {
      "title": "很多人都欣賞我「打不死」的精神及幽默感",
      "type": "I"
    },
    "test2": {
      "title": "很多人都欣賞我默默無言的幹勁及對人的慷慨",
      "type": "F"
    }
  }, {
    "test1": {
      "title": "太多時候我將焦點放在自己的身上",
      "type": "E"
    },
    "test2": {
      "title": "太多時候我將集中點放在別人的身上",
      "type": "A"
    }
  }, {
    "test1": {
      "title": "我著重人際關係多於達到目標",
      "type": "F"
    },
    "test2": {
      "title": "我著重達到目標多於人際關係",
      "type": "C"
    }
  }, {
    "test1": {
      "title": "我喜歡與人相處，又樂於支援別人",
      "type": "F"
    },
    "test2": {
      "title": "我為人含蓄及認真，喜歡與人討論時事",
      "type": "D"
    }
  }, {
    "test1": {
      "title": "我很注重我自己的感受，不輕易放下過去",
      "type": "E"
    },
    "test2": {
      "title": "我不太留意自己的感受",
      "type": "H"
    }
  }, {
    "test1": {
      "title": "我經常對自己要求過高",
      "type": "D"
    },
    "test2": {
      "title": "我經常感情用事又缺乏自律",
      "type": "E"
    }
  }, {
    "test1": {
      "title": "我有時會逼人太甚",
      "type": "F"
    },
    "test2": {
      "title": "我有時與人相處時，立場不夠堅定",
      "type": "A"
    }
  }, {
    "test1": {
      "title": "我寧願活在自己的小天地中",
      "type": "H"
    },
    "test2": {
      "title": "我需要這個世界知道我的存在",
      "type": "G"
    }
  }, {
    "test1": {
      "title": "很多時，我太過投入自己的事情而導致自我孤立",
      "type": "H"
    },
    "test2": {
      "title": "很多時，我太過投入別人的世界而忽略了自己的事情",
      "type": "F"
    }
  }, {
    "test1": {
      "title": "有多時候我缺乏自信",
      "type": "B"
    },
    "test2": {
      "title": "有多時候我祗是對自己有信心",
      "type": "G"
    }
  }, {
    "test1": {
      "title": "需要與人對抗時，我經常會表現得過份直接及硬朗",
      "type": "G"
    },
    "test2": {
      "title": "需要與人對抗時，我經常會轉彎抹角、辭不達意",
      "type": "C"
    }
  }, {
    "test1": {
      "title": "過去，我可能與朋友之間的關係過度親密",
      "type": "F"
    },
    "test2": {
      "title": "過去，我可能與朋友之間的距離太遠",
      "type": "C"
    }
  }, {
    "test1": {
      "title": "我覺得許多人都侵略我的私人空間及對我有過多的要求",
      "type": "H"
    },
    "test2": {
      "title": "我覺得許多人都缺乏組織能力及沒有責任感",
      "type": "D"
    }
  }, {
    "test1": {
      "title": "太多時候，我的自我懷疑令我裹足不前",
      "type": "E"
    },
    "test2": {
      "title": "我很少容許我的自我懷疑阻上我前進",
      "type": "C"
    }
  }, {
    "test1": {
      "title": "我憂慮我沒有足夠的資源去完成份內的職責",
      "type": "G"
    },
    "test2": {
      "title": "我憂慮我沒有足夠的自律性去追求心目中的目標",
      "type": "I"
    }
  }, {
    "test1": {
      "title": "一直以來我是個態度開放敢於嘗新的人",
      "type": "H"
    },
    "test2": {
      "title": "我不會自我掩飾，而且願意與人分享我的感受",
      "type": "E"
    }
  }, {
    "test1": {
      "title": "我是一個直覺能力強的個人主義者",
      "type": "E"
    },
    "test2": {
      "title": "我是一個組織能力強、極有責任感的人",
      "type": "D"
    }
  }, {
    "test1": {
      "title": "我時時都確保自己「後退有路」",
      "type": "B"
    },
    "test2": {
      "title": "我盡其量不去依賴別人",
      "type": "H"
    }
  }, {
    "test1": {
      "title": "我通常都跟隨我的良知及理性做人",
      "type": "D"
    },
    "test2": {
      "title": "我通常跟隨我的感受及直覺倣人",
      "type": "I"
    }
  }, {
    "test1": {
      "title": "我盡量不讓人覺得我是一個自私的人",
      "type": "F"
    },
    "test2": {
      "title": "我盡量不讓人覺得我是一個沉悶的人",
      "type": "I"
    }
  }, {
    "test1": {
      "title": "為了不被別人的需求所掩蓋，我盡量避免與人親密",
      "type": "H"
    },
    "test2": {
      "title": "為了不想令人失望，我盡量避免與人親密",
      "type": "C"
    }
  }, {
    "test1": {
      "title": "我的成就強差人意因為我沒有乘勢起飛",
      "type": "E"
    },
    "test2": {
      "title": "我的成就強差人意因為我「周身刀冇張利」",
      "type": "I"
    }
  }, {
    "test1": {
      "title": "我經常難以作出抉擇",
      "type": "B"
    },
    "test2": {
      "title": "我絕少有困難作出抉擇",
      "type": "G"
    }
  }, {
    "test1": {
      "title": "我經常強調我與朋友之間大不同之處",
      "type": "E"
    },
    "test2": {
      "title": "我經常強調我與朋友之間相同之處",
      "type": "A"
    }
  }, {
    "test1": {
      "title": "我很少表露感情",
      "type": "H"
    },
    "test2": {
      "title": "我經常表露感情",
      "type": "F"
    }
  }, {
    "test1": {
      "title": "我是一個充滿善意的支援者",
      "type": "F"
    },
    "test2": {
      "title": "我充滿衝勁，取得我應得的",
      "type": "C"
    }
  }, {
    "test1": {
      "title": "就算我的朋友做錯了事，我對他們也不離不棄",
      "type": "B"
    },
    "test2": {
      "title": "我不會為了友情而放棄原則",
      "type": "D"
    }
  }, {
    "test1": {
      "title": "我通常絕對不會炫耀我的才幹",
      "type": "A"
    },
    "test2": {
      "title": "我通常會令朋友清楚我的才幹",
      "type": "C"
    }
  }, {
    "test1": {
      "title": "我傾向於遲疑不決及有拖延的壞習慣",
      "type": "B"
    },
    "test2": {
      "title": "我是一個大膽及專橫的人",
      "type": "G"
    }
  }, {
    "test1": {
      "title": "別人時常覺得我舉棋不定",
      "type": "B"
    },
    "test2": {
      "title": "別人時常覺得我過份自信",
      "type": "D"
    }
  }, {
    "test1": {
      "title": "我是一個好客兼且喜歡結交新朋友的人",
      "type": "F"
    },
    "test2": {
      "title": "我重視私人空間，不太喜歡與人相處",
      "type": "E"
    }
  }, {
    "test1": {
      "title": "我盡量結識朋友，建立人際網絡",
      "type": "C"
    },
    "test2": {
      "title": "我很少結識朋友，也沒有刻意建立人際網絡",
      "type": "E"
    }
  }, {
    "test1": {
      "title": "我看見別人犯錯時，不會作聲",
      "type": "E"
    },
    "test2": {
      "title": "我經常協助別人看到他們所犯的錯誤",
      "type": "D"
    }
  }, {
    "test1": {
      "title": "我時常憂慮不被別人邀請參予活動",
      "type": "F"
    },
    "test2": {
      "title": "我時常憂慮參予別人的活動會令我分心",
      "type": "D"
    }
  }, {
    "test1": {
      "title": "當我不喜歡某人時，我會客氣地與對方保持距離",
      "type": "C"
    },
    "test2": {
      "title": "當我不喜歡某人時，我會想盡方法讓對方知道",
      "type": "B"
    }
  }, {
    "test1": {
      "title": "我通常說話謹慎、直接、不會轉彎抹角",
      "type": "G"
    },
    "test2": {
      "title": "我說話機靈、快速、生動",
      "type": "I"
    }
  }, {
    "test1": {
      "title": "結識新朋友的時候，我會較為含蓄",
      "type": "C"
    },
    "test2": {
      "title": "我容易與人一見如故",
      "type": "I"
    }
  }, {
    "test1": {
      "title": "我通常要等一段長時間才採取行動",
      "type": "H"
    },
    "test2": {
      "title": "我通常很快便能採取行動",
      "type": "D"
    }
  }, {
    "test1": {
      "title": "我參予的事務均有潛能替我增進財富及知名度",
      "type": "C"
    },
    "test2": {
      "title": "為了做自己有興趣的工作，我寧願放棄名利",
      "type": "H"
    }
  }, {
    "test1": {
      "title": "在大部份情況底下，我選擇做領袖",
      "type": "G"
    },
    "test2": {
      "title": "在大部份情況底下，我選擇讓別人做領袖",
      "type": "A"
    }
  }, {
    "test1": {
      "title": "我盡量加快自己生命的步伐，活得精彩",
      "type": "I"
    },
    "test2": {
      "title": "我盡量令自己的生命穩定及安寧",
      "type": "A"
    }
  }, {
    "test1": {
      "title": "我對生命具有強烈的信念，也有清晰的方向感",
      "type": "D"
    },
    "test2": {
      "title": "我對生命充滿疑慮，也經常懷疑所選擇的路向",
      "type": "H"
    }
  }, {
    "test1": {
      "title": "我經常用大計劃及大承諾去推動身邊的人",
      "type": "G"
    },
    "test2": {
      "title": "我經常向人指出不跟隨我的意見之後果，以推動他們走正確的路",
      "type": "D"
    }
  }, {
    "test1": {
      "title": "當與人發生磨擦的時候，我傾向於退縮",
      "type": "E"
    },
    "test2": {
      "title": "當與人發生磨擦的時候，我絕少退縮",
      "type": "G"
    }
  }, {
    "test1": {
      "title": "被人施壓時，我會退縮",
      "type": "H"
    },
    "test2": {
      "title": "被人施壓時，我的侵略感會大增",
      "type": "I"
    }
  }, {
    "test1": {
      "title": "我經常覺得需要表現得堅強",
      "type": "G"
    },
    "test2": {
      "title": "我經常覺得事事都要做得完美",
      "type": "C"
    }
  }, {
    "test1": {
      "title": "我喜歡挑戰別人，令他們不再安於現狀",
      "type": "G"
    },
    "test2": {
      "title": "我是一個積極及有自律的人",
      "type": "F"
    }
  }, {
    "test1": {
      "title": "我時常問艱深的問題，及保持獨立性",
      "type": "H"
    },
    "test2": {
      "title": "我時常希望保持穩定及心緒平靜",
      "type": "A"
    }
  }, {
    "test1": {
      "title": "我的不投入態度令我產生許多人際問題",
      "type": "A"
    },
    "test2": {
      "title": "我急切令人依賴我的態度令我產生許多人際問題",
      "type": "F"
    }
  }, {
    "test1": {
      "title": "我不畏懼與人對抗",
      "type": "G"
    },
    "test2": {
      "title": "我盡量避免與人對抗",
      "type": "A"
    }
  }, {
    "test1": {
      "title": "我的思維傾向於探討性，充滿好奇及幻想",
      "type": "H"
    },
    "test2": {
      "title": "我的思想實際，集中於解決目前的問題",
      "type": "B"
    }
  }, {
    "test1": {
      "title": "我經常做我需要做的事情",
      "type": "B"
    },
    "test2": {
      "title": "我經常做我想做的事情",
      "type": "E"
    }
  }, {
    "test1": {
      "title": "我擅長於主宰環境",
      "type": "G"
    },
    "test2": {
      "title": "我擅長於敘述我內在的感受",
      "type": "E"
    }
  }, {
    "test1": {
      "title": "我傾向於直接介入向人伸出援手",
      "type": "F"
    },
    "test2": {
      "title": "我傾向於教人如何自救",
      "type": "G"
    }
  }, {
    "test1": {
      "title": "我的個人風格傾向於嚴肅及簡約",
      "type": "H"
    },
    "test2": {
      "title": "我的個人風格傾向於誇大",
      "type": "I"
    }
  }, {
    "test1": {
      "title": "我重視追求我的興趣多於得到實際的成績",
      "type": "H"
    },
    "test2": {
      "title": "我為人實事求是，同時期望我的努力會產生實在的成果",
      "type": "G"
    }
  }, {
    "test1": {
      "title": "我的好戰性格有時令人卻步",
      "type": "G"
    },
    "test2": {
      "title": "我的嚴肅態度有時令人卻步",
      "type": "D"
    }
  }, {
    "test1": {
      "title": "能夠替人服務及照顧別人的需求對我而言是非常重要的",
      "type": "F"
    },
    "test2": {
      "title": "對我來說，能夠以不同的方式做事及看這個世界是很重要的",
      "type": "H"
    }
  }, {
    "test1": {
      "title": "如果要在新與舊之間作出抉擇，我多數會揀新的那樣",
      "type": "I"
    },
    "test2": {
      "title": "我多數會選擇自己熟悉的東西，因為我不想冒險嘗新，揀了自己不喜歡的東西",
      "type": "B"
    }
  }, {
    "test1": {
      "title": "我經常想起過往的事情",
      "type": "E"
    },
    "test2": {
      "title": "我經常思考我將會做的事情",
      "type": "I"
    }
  }, {
    "test1": {
      "title": "當我缺乏安全感的時候，我會變得囂張及不理睬別人",
      "type": "C"
    },
    "test2": {
      "title": "當我缺乏安全感的時候，我的防衛性會增強，同時變得喜歡辯駁",
      "type": "B"
    }
  }, {
    "test1": {
      "title": "在別人的心目中，我是一個大方得體、值得仰慕的人",
      "type": "C"
    },
    "test2": {
      "title": "在別人的心目中，我是一個古怪甚至冷漠的人",
      "type": "H"
    }
  }, {
    "test1": {
      "title": "當我不知所措的時候，我會要求別人給我意見",
      "type": "B"
    },
    "test2": {
      "title": "當我不知所措的時候，我會嘗試用不同的方式解決問題",
      "type": "I"
    }
  }, {
    "test1": {
      "title": "一般而言，我是個悲觀的人",
      "type": "E"
    },
    "test2": {
      "title": "一般而言，我是個樂觀的人",
      "type": "A"
    }
  }, {
    "test1": {
      "title": "我明白很多時候我對人太過熱情",
      "type": "F"
    },
    "test2": {
      "title": "我明白我很多時候對人太過冷漠",
      "type": "C"
    }
  }, {
    "test1": {
      "title": "對我來說，達到社會的既定制約是很重要的",
      "type": "E"
    },
    "test2": {
      "title": "對我來說，達到社會的既定制約沒有什麼重要性",
      "type": "B"
    }
  }, {
    "test1": {
      "title": "過去幾年以來，我的價值觀及生活方式經歷多次的轉變",
      "type": "C"
    },
    "test2": {
      "title": "過去幾年以來，我的價值觀及生活方式都保持不變",
      "type": "D"
    }
  }, {
    "test1": {
      "title": "我覺得自己充滿陽光氣息，隨遇而安",
      "type": "A"
    },
    "test2": {
      "title": "我覺得自己是個認真及有尊嚴的人",
      "type": "D"
    }
  }, {
    "test1": {
      "title": "我給予許多人關懷及照顧",
      "type": "F"
    },
    "test2": {
      "title": "我給予許多人鼓勵及方向感",
      "type": "G"
    }
  }, {
    "test1": {
      "title": "成為眾人焦點所在對我而言是自然不過的現象",
      "type": "C"
    },
    "test2": {
      "title": "成為眾人焦點所在令我覺得不自然",
      "type": "E"
    }
  }, {
    "test1": {
      "title": "我不善於處理細節",
      "type": "I"
    },
    "test2": {
      "title": "我善於處理細節",
      "type": "C"
    }
  }, {
    "test1": {
      "title": "過求悲觀及經常投訴令我產生很多人際之間的問題",
      "type": "B"
    },
    "test2": {
      "title": "過度的操控及專制令我產生很多人際之間的問題",
      "type": "G"
    }
  }, {
    "test1": {
      "title": "在危急的情況底下，我傾向於做「塘邊鶴」",
      "type": "H"
    },
    "test2": {
      "title": "在危急的情況底下，我多數會置身事中",
      "type": "G"
    }
  }, {
    "test1": {
      "title": "我傾向於信任我的感受並依據之行事，然後隨遇而安",
      "type": "F"
    },
    "test2": {
      "title": "我很少依據我的感受行事，因為我害怕這樣做會製造更多的問題",
      "type": "A"
    }
  }, {
    "test1": {
      "title": "別人對我產生興趣因為我為人外向，而且對人有興趣",
      "type": "F"
    },
    "test2": {
      "title": "別人對我產生興趣因為我為人含蓄、安靜及有深度",
      "type": "E"
    }
  }, {
    "test1": {
      "title": "我需要做別人心目中的強者，因此我沒有時間去處理自己的感受及恐懼",
      "type": "G"
    },
    "test2": {
      "title": "我不懂得處理自己的感受及恐懼，因此無法成為人別人心目中的強者",
      "type": "E"
    }
  }, {
    "test1": {
      "title": "我對人太過干預，因此製造了許多人際問題",
      "type": "F"
    },
    "test2": {
      "title": "我慣性逃避人際溝通，因此製這了許多人際問題",
      "type": "B"
    }
  }, {
    "test1": {
      "title": "我在人面前表現得較實際堅強",
      "type": "G"
    },
    "test2": {
      "title": "我在人面前表現得較實際更關懷別人",
      "type": "F"
    }
  }, {
    "test1": {
      "title": "吸引到我的課題可能會別人感覺恐懼或不安",
      "type": "H"
    },
    "test2": {
      "title": "我選擇不去花費時間研究令我感覺恐懼或不安的課題",
      "type": "A"
    }
  }, {
    "test1": {
      "title": "時不與我的逆境令我更堅強",
      "type": "C"
    },
    "test2": {
      "title": "時不與我的逆境令我洩氣及退縮",
      "type": "A"
    }
  }, {
    "test1": {
      "title": "很可能我屬於過份被動及不投入",
      "type": "A"
    },
    "test2": {
      "title": "很可能我傾向於過度操控別人",
      "type": "F"
    }
  }, {
    "test1": {
      "title": "一般而言，我的情緒屬於穩定",
      "type": "C"
    },
    "test2": {
      "title": "一般而言，我的情緒波動頗大",
      "type": "I"
    }
  }, {
    "test1": {
      "title": "我喜歡在高壓甚至困難的環境中運作",
      "type": "G"
    },
    "test2": {
      "title": "我討厭在高壓及困難的環境中運作",
      "type": "A"
    }
  }, {
    "test1": {
      "title": "我運用身體的接觸去令人感受我對他們的關懷",
      "type": "F"
    },
    "test2": {
      "title": "我認為真正的關懷並不需要用身體的接觸去表達",
      "type": "D"
    }
  }, {
    "test1": {
      "title": "我主要的挑戰之一是克服惰性",
      "type": "A"
    },
    "test2": {
      "title": "我主要的挑戰之一是令自己慢下來",
      "type": "I"
    }
  }, {
    "test1": {
      "title": "我需要有強烈的歸屬感",
      "type": "B"
    },
    "test2": {
      "title": "我需要有強烈的平衡感",
      "type": "D"
    }
  }, {
    "test1": {
      "title": "我對自己能夠彈性處理事情引以為傲，因為目前看來重要或適宜的選擇都會改變",
      "type": "C"
    },
    "test2": {
      "title": "我對自己能夠堅持立場引以為傲，因為我深信自己所代表的一切",
      "type": "D"
    }
  }, {
    "test1": {
      "title": "追求個人興趣比較個人舒適及安全感重要",
      "type": "H"
    },
    "test2": {
      "title": "擁有個人舒適及安全感比較追求個人興趣更重要",
      "type": "B"
    }
  }, {
    "test1": {
      "title": "我傾向於做人積極及有焦點",
      "type": "H"
    },
    "test2": {
      "title": "我傾向於做人即興及有趣味",
      "type": "I"
    }
  }, {
    "test1": {
      "title": "我不是一個敢言的人",
      "type": "E"
    },
    "test2": {
      "title": "我絕對敢言，經常說出別人不敢講的說話",
      "type": "I"
    }
  }, {
    "test1": {
      "title": "我傾向於抽離及時常若有所思",
      "type": "H"
    },
    "test2": {
      "title": "我傾向於情緒化及自我中心",
      "type": "E"
    }
  }, {
    "test1": {
      "title": "別人相信我的知識及洞悉力",
      "type": "H"
    },
    "test2": {
      "title": "別人信賴我的決斷與個人力量",
      "type": "G"
    }
  }, {
    "test1": {
      "title": "我的抽離態度不時觸怒別人",
      "type": "E"
    },
    "test2": {
      "title": "我慣性教人如何做事的態度不時觸怒別人",
      "type": "D"
    }
  }, {
    "test1": {
      "title": "生命那麼美好，我不明白為何有些人祗集中去看負面的一邊",
      "type": "A"
    },
    "test2": {
      "title": "生命那麼糟糕，我不明白為何有些人還是那麼開心",
      "type": "D"
    }
  }]
};